# Используем официальный Node.js образ в качестве базового образа
FROM node:18

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и yarn.lock в рабочую директорию
COPY package.json yarn.lock ./

# Устанавливаем зависимости
RUN yarn install

# Копируем все файлы из текущей директории на хосте в рабочую директорию в контейнере
COPY . .

# Строим приложение для продакшена
RUN yarn build

# Устанавливаем команду, которая будет выполняться при запуске контейнера
CMD ["yarn", "serve"]

# Указываем, что контейнер будет слушать порт 8080
EXPOSE 8080
